Revit 2015 API
ViewShapeBuilder.SetShape Method
Overload List
Name | Description
SetShape(DirectShape)
 Set a view-specific shape of the DirectShape object to geometry accumulated in this ViewShapeBuilder object. The view type currently set in ViewShapeBuilder is used. Since the accumulated geometry was validated by ViewShapeBuilder already, this skips the second validation in DirectShape. This function resets this ViewShapeBuilder object: the geometry is transferred to DirectShape, view normal and view type are invalidated.
SetShape(DirectShapeType)
 Set a view-specific shape of the DirectShapeType object to geometry accumulated in this ViewShapeBuilder object. The view type currently set in ViewShapeBuilder is used. Since the accumulated geometry was validated by ViewShapeBuilder already, this skips the second validation in DirectShapeType. This function resets this ViewShapeBuilder object: the geometry is transferred to DirectShapeType, view normal and view type are invalidated.
See Also
ViewShapeBuilder Class
ViewShapeBuilder Members
Autodesk.Revit.DB Namespace